const obj = {
  code: 0, 
  message: 'ok',
  data: {
      title: '风吹过八千里-苏星婕',
      author: '巴欧特',
      duration: '03:48',
      pic1: 'https://p1.music.126.net/9RpZgMal5PCItO1V3BW3Dw==/…04602570.jpg?imageView=1&type=webp&thumbnail=84x0',
      pic2:'https://p1.music.126.net/OMsDBqt6edmlgM0gkct1Vg==/109951167086636585.jpg?imageView&thumbnail=360y360&quality=75&tostatic=0',
      pic3:'http://p1.music.126.net/OMsDBqt6edmlgM0gkct1Vg==/109951167086636585.jpg?imageView&thumbnail=50y50&quality=15&tostatic=0',
      audio: 'images/obj_w5rDlsOJwrLDjj7CmsOj_14096415920_26ab_f20e_c468_ab202a85a05ce2992470e8cad310ecd2.m4a',
      lyric: "[00:00.000] 作词 : 巴欧特\n[00:01.000] 作曲 : Moni鱼子酱\n[00:02.000] 编曲 : 东阳\n[00:19.407]有些话何必说清没有意义\n[00:26.175]请你当做我自作多情\n[00:34.194]一人完成两个人的不通关游戏\n[00:41.213]为何你还不满意\n[00:47.482]冰箱里的东西早就过期\n[00:52.250]留言还是周一\n[00:55.509]到夜深人静\n[00:58.016]只剩我和空气没道理\n[01:03.535]你说爱情仅此而已\n[01:07.296]谁还没有一丝委屈\n[01:11.056]不再关心我的世界下了雨\n[01:17.576]像风吹过八千里\n[01:21.336]流云和月都曾爱过你\n[01:25.097]可是潮汐干涸在有情人的海底\n[01:32.618]那最潮湿的爱意\n[01:36.380]携裹着最伤人语句\n[01:41.672]或许遥不可及才得人心\n[02:02.740]冰箱里的东西早就过期\n[02:07.561]留言还是周一\n[02:10.320]到夜深人静\n[02:12.578]只剩我和空气没道理\n[02:18.347]你说爱情仅此而已\n[02:22.109]谁还没有一丝委屈\n[02:25.868]不再关心我的世界下了雨\n[02:32.639]像风吹过八千里\n[02:36.651]流云和月都曾爱过你\n[02:40.163]可是潮汐干涸在有情人的海底\n[02:47.685]那最潮湿的爱意\n[02:51.446]携裹着最伤人语句\n[02:56.210]或许遥不可及才得人心\n[03:02.982]像风吹过八千里\n[03:06.494]流云和月都曾爱过你\n[03:10.255]可是潮汐干涸在有情人的海底\n[03:17.530]那最潮湿的爱意\n[03:21.540]携裹着最伤人语句\n[03:26.307]或许遥不可及 才得人心\n[03:30.795] 录音师 : 候天宇\n[03:35.283] 录音棚 : 莫非录音棚（成都）\n[03:39.771] 混音/母带 : 候天宇\n[03:44.259] 监制 : 莫非\n[03:48.747] 设计 : 晴纸\n"
  }
}

const API = {
    queryLyric() {
        return new Promise(resolve => {
            setTimeout(
                () => {
                    resolve(obj)
                },
                Math.round(Math.random() * (2000 - 500) + 500)
            )
        })
    }
}